Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །གང་ཟག་དེས་རྒྱུ་དང་རྐྱེན་གང་གི་ཕྱིར་གཅིན་གྱི་བུམ་པ་དང་། དུག་གི་བུམ་པ་དང་། ཐལ་བ་དང་། མེ་དག་ཐོགས་ཏེ་འོངས་ནས་བདག་གི་ལུས་ལ་གནོད་པར་བྱེད་པ་ན་བདག་གི་ལུས་ནི་དངོས་པོ་འདི་དག་གི་རྒྱུ་དང་རྐྱེན་གྱིས་ན་བ་དང་། གནོད་པར་མི་འགྱུར་རོ། །ཞེས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚེ་འདི་ལྟར་རྒྱུ་དང་རྐྱེན་མང་པོའི་ཆོས་ལ་སོ་སོར་བརྟགས་ནས་སུ་ཞིག་ནི་དངོས་པོ་འདི་སྦྱིན་པར་བྱེད། དངོས་པོ་འདི་ནི་སུ་ལ་སྦྱིན་པར་བྱེད། དངོས་པོ་གང་ནི་སྦྱིན་པར་བྱེད་ཅེས་དེས་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ན་སྦྱིན་པར་བྱེད་པ་ནི་སུ་ཡིན། ལེན་པར་བྱེད་པ་ནི་སུ་ཡིན། ཆོས་ནི་གང་ཡིན་ཞེས་ཆོས་འགའ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Such bodhisattvas will think, ‘When that person comes to me carrying a vase filled with urine, poison, ashes, or embers and tries to harm my body, my body is not hurt or injured by those substances.’ Thus analyzing things in terms of their multiple causes and conditions, bodhisattvas will then contemplate this matter in accordance with the way things really are, asking themselves, ‘Who is pouring these substances on me?’ ‘On whom are these substances poured?’ ‘What are the substances poured?’ At that time, they will not find anyone who is the pourer, anyone who is the recipient of this act, or anything that is poured.

source: །དེ་ལྟར་ཡང་དག་པའི་དྲན་པས་ཡིད་ལ་བྱེད་ཅིང་སོ་སོར་རྟོག་པའི་ཚེ་འདི་དང་དེ་ཞེས་བྱ་བ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་དམིགས་པར་ཡང་མི་འགྱུར་ལ་མཐོང་བར་ཡང་མི་འགྱུར་རོ།
en: Contemplating and investigating in this way with proper mindfulness, they will not find any of these things, and they will therefore not apprehend or behold any phenomenon.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེས་ཆོས་ཐམས་ཅད་མི་དམིགས་ཤིང་མི་མཐོང་བའི་ཕྱིར་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་ཡང་སྐྱེད་པར་མི་བྱེད་དོ།
en: Because they do not apprehend or behold any phenomenon, they will also not give rise to anger or resentment.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔས་གལ་ཏེ་དེ་ལྟར་བསམས་ཀྱང་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པའི་བསམ་པ་སྐྱེས་པར་གྱུར་ན། གཞན་ཡང་འདི་ལྟར་ཡང་དག་པའི་དྲན་པས་འདི་སྙམ་དུ་རེག་བྱ་གང་གི་རྒྱུ་དང་རྐྱེན་གྱིས་བདག་གི་ལུས་ལན་པར་བྱེད། རེག་བྱ་དེ་དག་གིས་གང་དུ་ནི་རེག་པར་འགྱུར། ལུས་ལ་གནོད་པར་གྱུར་ཏམ། འོན་ཏེ་སེམས་ལ་གནོད་པར་གྱུར།
en: “Pūrṇa, despite the fact that they reflect in that way, if anger and resentment nonetheless arise in the minds of these bodhisattvas, they should think in this way, with genuine mindfulness: ‘Through the causes and conditions of what tactile objects is my body hurt? Where did those tactile objects touch me? Did they harm my body, or did they harm my mind?

source: གལ་ཏེ་ལུས་ལ་གནོད་པར་གྱུར་པ་ཡིན་ན་ན་ལུས་ནི་རྩྭ་དང་། ཤིང་དང་། གྱོ་མོ་དང་། རྡོ་དང་། གཟུགས་བརྙན་ལྟ་བུ་ཡིན་པས་རྟོག་པ་མེད་པ། ཤེས་པ་མེད་པ་ཡིན་ཏེ། བདག་ཀྱང་མ་ཡིན། གཞན་ཡང་མ་ཡིན་ནོ།
en: If it is the case that they have harmed my body, since my body is like grass, like a log, like gravel, like a stone, or like an image, it is devoid of concepts and consciousness, and it is neither self nor other.

source: །གལ་ཏེ་སེམས་ལ་གནོད་པར་གྱུར་པ་ཡིན་ན་ན་སེམས་ནི་ཁ་དོག་དང་གཟུགས་མེད་པ། སྐད་ཅིག་མར་སྐྱེ་ཞིང་འགག་པ། ཐང་ཅིག་ཙམ་ཡང་མི་གནས་པས་བདག་ཀྱང་མ་ཡིན། གཞན་ཡང་མ་ཡིན་ན་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་བརྟགས་ནས་འདི་ནི་སྡུག་བསྔལ་ལོ།
en: If it is the case that they have harmed my mind, since my mind has neither color nor shape, since it arises and ceases every moment, and since it does not remain the same for a single instant, it is also neither self nor other.

source: །འདི་ནི་བདེ་བའོ། །འདི་ནི་སྡུག་བསྔལ་ཡང་མ་ཡིན། བདེ་བ་ཡང་མ་ཡིན་པའོ་ཞེས་ཟེར་བར་ཟད་པས་དེང་བདག་གིས་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་བརྟགས་པ་འདི་བསྐྱེད་པར་མི་བྱའོ།
en: Moreover, since it is always false conceptual imputations that express statements such as, “this is suffering,” “this is happiness,” and “this is neither suffering nor happiness,” I will no longer give rise to such false conceptual imputations.

source: །དེང་བདག་གིས་མཉམ་པ་ཉིད་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་དུ་བལྟས་ནས་འཕགས་པའི་བྱ་བ་རྣམས་བསྒྲུབ་པར་བྱའི།
en: Instead, I will now perceive reality from the perspective of the genuine characteristic of sameness and perform the activities of noble beings.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་བྱ་བའི་རྗེས་སུ་འབྲང་བར་མི་བྱའོ།
en: I will not engage in the activities of immature ordinary beings.

source: །འཕགས་པའི་བྱ་བ་གང་ཞེ་ན།
en: What are the activities of noble beings?

source: འདི་ལྟ་སྟེ། ཆོས་རྣམས་ལས་ཐག་རིང་དུ་གྱུར་ཅིང་རྣམ་པར་གྲོལ་བ་གང་ཡིན་པའོ།
en: Keeping a distance from and being liberated from phenomena.

source: །བདག་ནི་ཐག་བསྲིང་བའི་ཕྱིར་སློབ་པ་ཡིན། མི་ཕྲད་པར་བྱ་བའི་ཕྱིར་སློབ་པ་ཡིན་ན་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པ་འདི་དག་ནི་ཐམས་ཅད་ཀྱང་ཕྲད་པར་བྱེད་པ་ཡིན་ཏེ།
en: However, if I train in staying away from and avoiding phenomena, this will in fact connect me to all those false concepts.

source: སུ་དང་ཕྲད་པར་བྱེད་པ་ཡིན་ཞེ་ན།
en: To what will this approach connect me?

source: འདོད་ཆགས་དང་ཕྲད་པར་བྱེད་པ་ཡིན། ཞེ་སྡང་དང་། གཏི་མུག་དང་ཕྲད་པར་བྱེད་པ་ཡིན་ནོ།
en: It will connect me to desire, anger, and ignorance.

source: །ཇི་ལྟར་ན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་ཕྲད་པར་བྱེད་པ་ཡིན་ཞེ་ན།
en: How will this connect me to desire, anger, and ignorance?

source: ལུས་ལ་རྨོངས་པའི་ཕྱིར་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་རྨོངས་པའི་ཕྱིར་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་མངོན་པར་ཞེན་པའི་ཕྱིར་ལུས་ཀྱི་སྡུག་བསྔལ་མྱོང་བའི་ཚེ་གཞན་དག་ལ་མནར་སེམས་སྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཞེ་སྡང་དང་ཕྲད་པ་ཞེས་བྱའོ།
en: When someone experiences physical pain, due to the delusion related to the body and to the view of the transitory collection, and due to a strong clinging to this view of the transitory collection, this person will become hostile to others. This is known as connecting with anger.

source: །འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་རྨོངས་པ་དང་བཅས་པའི་ཕྱིར་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་མངོན་པར་ཞེན་པའི་ཕྱིར་དང་། ཡིད་དང་མི་འཐུན་པར་གྱུར་པའི་ཕྱིར་གཞན་དག་ལ་མནར་སེམས་སྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་གཏི་མུག་དང་ཕྲད་པ་ཞེས་བྱའོ།
en: Because of the delusion associated with the view of the transitory collection, and because of strongly clinging to this view combined with the experience of unpleasant circumstances, this person will become hostile to others. This is known as connecting with ignorance.

source: །གང་དག་འདི་ལྟ་བུའི་དུག་གསུམ་གྱིས་བཅིངས་ནས་འདི་ལྟ་བུའི་ཁ་ན་མ་ཐོ་བའི་ལས་ཀྱི་རྒྱུ་དང་རྐྱེན་སློང་བར་བྱེད་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་ཡོངས་སུ་སྐྱོབ་པར་མི་སྤྱོད་ན་གཞན་གྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: Those who are bound by these three poisons and create the causes and conditions for such wrongdoing will not be protected by the thus-gone ones, so surely not by anyone else either.

source: དེང་བདག་གིས་རྒྱུ་དང་རྐྱེན་གྱི་ཆོས་རྣམས་ཤིན་དུ་ལེགས་པར་སོ་སོར་བརྟགས་ནས་ཆོས་སྟོང་པ་ཉིད་དུ་བལྟ་བར་བྱའོ། །སྙམ་དུ་བསམ་པར་བྱའོ།
en: Hence I should think that I will now investigate these causal and circumstantial phenomena properly and view them as being emptiness.’

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་རྗེས་སུ་འཐུན་པར་ཡང་དག་པར་ལྟ་བས་རྒྱུ་དང་རྐྱེན་གྱི་ཆོས་རྣམས་སོ་སོར་རྟོག་པར་བྱེད་པ་ན་ཆོས་འགའ་ཙམ་ཡང་སུས་བྱིན་པའམ། སུས་ལེན་པའམ། དངོས་པོ་གང་ཡིན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: “When bodhisattvas investigate such phenomena in terms of their causes and conditions, by viewing them appropriately in this way, they will also not find anyone who gives, anyone who receives, or anything that is given.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་ཡང་འདི་སྙམ་དུ་ཆོས་ཐམས་ཅད་ནི་རྒྱུ་དང་རྐྱེན་མང་པོ་ལས་སྐྱེས་པ་ཡིན་པས་རང་བཞིན་གྱིས་གཟོད་མ་ཉིད་ནས་སྟོང་པ་ཡིན་ཏེ།
en: At that time, these bodhisattvas should think, ‘Since all phenomena arise from a variety of causes and conditions, they are naturally empty from the very beginning.

source: ངེས་པར་དམིགས་སུ་མེད་པར་སྟོང་པ་ཡིན་ན། བདག་ཅིའི་ཕྱིར་ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་དམིགས་སུ་མེད་པ་དག་ལ་ལས་མངོན་པར་འདུས་བྱས་ནས་ཞེ་སྡང་བསྐྱེད་དེ་འདུ་བྱེད་ཀྱི་རྒྱུ་རྐྱེན་སློང་བར་བྱེད།
en: So if they are empty and without any objective status whatsoever, why would I create karmic actions in relation to such untrue phenomena that cannot be apprehended? Why would I in this way create the causes and conditions for further formations by giving rise to anger?

source: དེང་བདག་གིས་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་མེད་པའི་བསམ་པ་བསྐྱེད་ནས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པའི་ཆོས་མངོན་པར་བསྒྲུབས་ནས་སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཉིད་དུ་བལྟ་བར་བྱའི།
en: Without any anger or resentment, I must instead realize that phenomena are unconditioned, nonarising, and unborn, and view them as having the nature of emptiness.

source: བདག་ཉིད་ཀྱི་སེམས་ཀྱི་རྗེས་སུ་འབྲང་བར་མི་བྱའོ། །དེང་བདག་གིས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པའི་ཆོས་ལ་བལྟ་བར་བྱའི། མངོན་པར་འདུ་བྱ་བ་དང་། འབྱུང་བའི་ཆོས་ལ་གནས་པར་མི་བྱའོ།
en: I will not follow after my mind, but instead, from now on, behold unconditioned, nonarising, and unborn phenomena, without dwelling on conditioned and manifest phenomena.

source: །བདག་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རྣམས་བསམ་པར་བྱའི། དེང་བདག་གིས་ཡང་དག་པ་མ་ཡིན་པ་ཡོད་པ་མ་ཡིན་པ་འདི་ལ་ནན་གྱིས་ཆོས་སུ་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱ་སྟེ།
en: I will contemplate phenomena as they really are, and from now on I will ardently avoid perceiving that which is inauthentic and nonexistent as being a phenomenon.

source: ཡང་དག་པ་མ་ཡིན་པ་ལ་ནན་གྱིས་མངོན་པར་འདུ་བྱེད་པ་ནི་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་དག་ཡིན་ནོ།
en: Anger and resentment consistently form what is inauthentic.

source: ཆོས་ཀྱི་ངོ་བོ་ལ་གནས་པ་ལ་ནི་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་ཡོད་ཀྱི།
en: Because anger and resentment are present whenever one dwells on phenomena having an essence.

source: ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་མཐར་སྟོང་པ་ཉིད་ལ་ནི་གནས་པར་བྱ་བའི་ཆོས་ཀྱི་ངོ་བོ་གཟོད་མ་ཉིད་ནས་མེད་པས་སོ་སྙམ་དུ་བསམ་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་ཆོས་རྣམས་ཡིད་ལ་བྱས་པར་གྱུར་ན། དེའི་སེམས་རབ་ཏུ་དབེན་པར་གྱུར་བས་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: However, within emptiness—the ultimately true characteristic of phenomena—there is primordially no essence of phenomena to dwell upon.’ When bodhisattvas contemplate phenomena in this way, their minds become completely disengaged, and anger and resentment will no longer arise in them.

source: གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་འགྲོའམ། འགྲེང་ངམ། འདུག་གམ། ཉལ་ལམ། གཉིད་ལོག་གམ། སད་པའི་ཚེ་ཡང་རུང་སྟེ། འགའ་ཞིག་འོངས་ནས་སྤོས་དྲི་ཞིམ་པའམ། སྤོས་ཀྱི་ཕྱེ་མའམ། བྱུག་སྤོས་སམ། མེ་ཏོག་མཆོག་དམ་པ་ལུས་ལ་གཏོར་རམ།
en: “Furthermore, Pūrṇa, whenever bodhisattvas are walking, standing, sitting, lying down, sleeping, or awake, if someone scatters fragrant perfumes, fragrant powders, fragrant ointments, or the most sublime flowers upon their bodies;

source: ཡང་ན་སྤོས་དང་། མེ་ཏོག་མཆོག་དམ་པ་དང་། སེ་མོ་དོ་དང་། མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བ་དང་། མེ་ཏོག་མང་པོའི་ཕྲེང་བདག་གིས་ལུས་ལ་གཡོགས་པར་གྱུར་ཏམ། ཡང་ན་གོས་མཆོག་དམ་པ་ཤིན་ཏུ་ཕྲ་ཞིང་འཇམ་པ་འདི་ལྟ་སྟེ། ཀ་ཤི་ཀའམ། ཀུ་ཤ་ཀའམ། ཀུ་ཤ་པའམ། ཀུ་མ་པའམ། ཀུ་ཤ་ཡ་ཤའམ། ཆུ་མ་འམ། ཀ་བའམ། དེ་དག་ལ་སོགས་པ་གོས་ཕྲ་ཞིང་འཇམ་པ་དག་གིས་ལུས་ལ་གཡོགས་པར་གྱུར་ཏམ། ཡང་ན་དར་གྱི་ལྡ་ལྡི་མཆོག་དམ་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་བདག་ཉིད་ཀྱི་སྟེང་དུ་བྲེས་པར་གྱུར་ཏམ། ཡང་ན་ལྷའི་མེ་ཏོག་དང་། སྤོས་དང་། གོས་མཆོག་དམ་པ་དང་། རིན་པོ་ཆེའི་ཕྲེང་བ་དག་གིས་ལུས་གཡོགས་པར་གྱུར་ཏམ། ཡང་ན་ལྷའི་ཁ་ཟས་མཆོག་དམ་པ་བདུད་རྩིའི་རོ་དང་ལྡན་པ་དག་ཁྱེར་ཏེ་འོངས་ནས་བྱིན་པར་གྱུར་ན། བྱང་ཆུབ་སེམས་དཔས་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་འདི་དག་ལ་སྲེད་པའི་ཕྱིར་སེམས་བསྐྱེད་ནས་མངོན་པར་ཞེན་པར་མི་བྱའོ།
en: or if someone covers their bodies with perfumes, the most sublime types of flowers, necklaces, garlands of campaka, garlands of varṣika, or garlands made of many other types of flowers; or if someone covers their bodies with the most sublime, refined, and soft types of fabrics, like those from kāśī, kuśaka, kuśapa, kumapa, kuśayaśa, chuma, and kaba; or if someone hoists the most sublime types of silken streamers, parasols, victory banners, and flags above them; or if someone covers their bodies with divine flowers, perfumes, sublime types of fabrics, and garlands of jewels; or if someone comes to them carrying the most delectable, divine food, as delicious as nectar, and offers it to them—in all such cases these bodhisattvas should not crave any of those offerings because they are fond of such things.

source: །རྐྱེན་དེས་གང་ཟག་དེ་དག་ལ་བསྟེན་ནས་ཡིད་དང་འཐུན་པར་བྱས་ཏེ་ཕན་ཚུན་འདྲུལ་ཞིང་གཏམ་སྨྲ་བར་ཡང་མི་བྱའོ།
en: They should also not keep company or become intimate with such people, walking around or conversing with them.

source: །ཕྱོགས་གཅིག་པའི་སེམས་ཀྱིས་རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱའོ།
en: They should also not become attached to those people with a biased attitude.

source: །བྱང་ཆུབ་སེམས་དཔས་དེ་དག་ལ་སེམས་སྙོམས་པར་བྱ་ཞིང་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་རབ་ཏུ་རྟོགས་པར་བྱས་ནས་འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་རྣམས་ལ་ཁོང་ཁྲོ་བར་ཡང་མི་བྱ། རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Rather, bodhisattvas should maintain an attitude of equanimity toward such people. Realizing the sameness of all phenomena, they should think, ‘I will not become angry at sentient beings or become attached to them. Why not?

source: བྱམས་སྡང་གི་དངོས་པོ་གཉི་ག་ཡང་ཉོན་མོངས་པ་ཡིན་པས་སོ།
en: Because both attachment and aversion are disturbing emotions.

source: །དེང་བདག་གིས་དེ་དག་ལ་སྲེད་པ་མི་བསྐྱེད་པར་ཆོས་རྣམས་ཀྱི་ཡང་དག་པ་ཉིད་ལེགས་པར་རྟོགས་པར་བྱའོ།
en: Therefore, I will now properly realize the actual nature of phenomena, without craving them.

source: ཉོན་མོངས་པ་རྣམས་ཀྱི་ནང་ན་སྲེད་པའི་རྐྱེན་གྱིས་ཕྲད་པར་གྱུར་པ་འདི་མཆོག་ཏུ་ལྕི་བས་སོ།
en: Because, among all the disturbing emotions, those connected to craving are the heaviest of all.

source: །འདི་ལྟར་ཉོན་མོངས་པ་དེ་ནི་རུས་པ་དང་རྐང་ལ་ཡང་ཐལ་ཏེ་འགྲོ་བས་ཀུན་ཏུ་སྦྱོར་བ་སྐྱེད་པའི་ཆོས་ཀྱི་ནང་ན་སྲེད་པའི་སེམས་ཀྱིས་ནི་ཤིན་དུ་མངོན་པར་ཞེན་པར་བྱེད་དོ།
en: This disturbing emotion penetrates even to the bone and marrow, for among the things that can bind beings, craving is what causes clinging.

source: འདོད་ཆགས་པར་བྱ་བའི་དངོས་པོ་གལ་ཏེ་ཡིད་བཞིན་དུ་ཐོབ་པར་མ་གྱུར་ན་ཞེ་སྡང་སྐྱེ་བར་འགྱུར་བས་སོ།
en: Because if we are attached to something and our wishes are not fulfilled, we will also become angry.

source: །སྐྱེ་བོ་རྣམས་ནི་རང་གི་ལུས་ལ་འདོད་ཆགས་ཀྱི་སྲེད་པ་སྐྱེད་པར་བྱེད་པས་དེ་དག་གལ་ཏེ་འགའ་ཞིག་གིས་གནོད་པར་བྱས་པར་གྱུར་ན་ཞེ་སྡང་སྐྱེ་བར་འགྱུར་བས།
en: Since beings are attached to their bodies, if someone harms them, they become angry.

source: དེའི་ཕྱིར་ཞེ་སྡང་ནི་སྲེད་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡིན་ལ། མངོན་པར་ཞེན་པ་ནི་གཏི་མུག་གི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Therefore, one should know that anger is a karmic ripening that results from craving, while clinging is a karmic ripening that results from ignorance.

source: །དེང་བདག་ནི་སྲེད་པས་གོས་པའི་སེམས་སྤངས་ནས་ཆོས་རྣམས་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ།
en: I will now discard this mind that is sullied by craving and stop clinging to phenomena.

source: །བདག་ནི་འདོད་ཆགས་ཀྱི་ཕྱིར་སློབ་པ་མ་ཡིན། ཞེ་སྡང་གི་ཕྱིར་སློབ་པ་མ་ཡིན། གཏི་མུག་གི་ཕྱིར་སློབ་པ་མ་ཡིན་གྱི།
en: I will no longer perpetuate the manifestation of desire, anger, or ignorance.

source: བདག་ནི་ཆོས་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་ལ་རྒྱ་ཆེར་སློབ་པ་ཡིན་པས་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བལྟས་ནས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་ཡང་དག་པ་ཉིད་དུ་སྤྱད་ནས་ལས་དང་རྣམ་པར་སྨིན་པའི་རྒྱུ་རྐྱེན་ལ་བརྟེན་ཏེ་མཆོད་པ་དང་། སྡུག་བསྔལ་གྱི་དངོས་པོ་རྣམས་ཀྱང་སྔོན་གྱི་ལས་ཀྱི་སྤྱོད་པའི་རྐྱེན་ལས་གྱུར་པ་ཡིན་པར་རིག་པར་བྱས་ནས་དེའི་ཕྱིར་རྗེས་སུ་འཐུན་པར་གྱུར་པའི་ཆོས་རྣམས་ལ་ཡང་དགའ་ཞིང་སྲེད་པ་མི་བསྐྱེད།
en: I will instead train intensively in realizing the suchness of phenomena, thereby viewing the characteristics of phenomena as they really are. In accordance with the teachings, I will act properly and thus rely on the causes and conditions that lead to karmic ripening. Knowing that the circumstances of both veneration and hardship are conditioned by previous actions, I will delight in conducive factors and never give rise to craving.

source: དགེ་བའི་ཆོས་དང་འགལ་བ་ལ་ཡང་ཞེ་སྡང་མི་བསྐྱེད་པར་སེམས་ཡོངས་སུ་སྦྱངས་ཏེ་མནར་སེམས་མེད་པར་བྱས་ནས་འདོད་ཆགས་ཀྱི་རྗེས་སུ་འབྲང་བར་ཡང་མི་བྱ།
en: I will purify my mind without ever giving rise to anger, even toward those beings who oppose virtue.

source: ཞེ་སྡང་གི་རྗེས་སུ་འབྲང་བར་ཡང་མི་བྱ། གཏི་མུག་གི་རྗེས་སུ་འབྲང་བར་ཡང་མི་བྱ། སྡིག་པའི་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་ཡང་མི་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་དང་པོ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: I will eliminate ill will from my mind and never follow desire, anger, or ignorance, or engage in negative actions.’ Pūrṇa, bodhisattvas who possess this first quality will achieve all excellent qualities.” At that moment, the Blessed One uttered these verses to explain this clearly:

source: ངས་ནི་རྟག་ཏུ་ཤེས་རབ་བསྔགས།
en: “I have always praised insight,

source: །ཚུལ་ཁྲིམས་བསྲུང་བའང་བསྔགས་པ་ཡིན།
en: Guarding one’s discipline,

source: །བཟོད་པ་བསྒོམ་ལ་བསྔགས་བྱས་ཤིང་།
en: And cultivating patience,

source: །མང་དུ་ཐོས་པའང་བསྔགས་པ་ཡིན།
en: As well as erudition.

source: །ངས་ནི་དགེ་བའི་ཆོས་སྤྱོད་དང་། །བྱམས་སེམས་ཚིག་སྙན་སྨྲ་ལ་བསྔགས། །སེམས་ཅན་ལ་ནི་ཕན་གདགས་ཕྱིར། །ཡོན་ཏན་མང་པོ་ཅི་རིགས་བསྔགས།
en: “I have always praised the practices of virtue, Love, and speaking with pleasant words, As well as all the various kinds of qualities That benefit sentient beings.

source: །ང་ནི་རྟག་ཏུ་འདོད་ལྔ་དང་། །ཁོང་ཁྲོ་འཁོན་འཛིན་གཏི་མུག་ཅན། །ཕྲག་དོག་ང་རྒྱལ་གཡོ་སྒྱུ་དང་། །འཁྲུག་ལོང་སེམས་ཅན་གནོད་བྱེད་དམོད། །ལེ་ལོ་དང་ནི་སྙོམ་ལས་དང་། །བཀའ་བློ་མི་བདེ་སྨྲ་དགའ་དང་། །བྱས་པ་མི་གཟོ་ལམ་ལོག་ཅན།
en: “I have always criticized the desires of the five senses, As well as aggression, resentment, ignorance, Envy, pride, deceit, Conflict, and harming sentient beings. “I have never praised Laziness, indolence, Rejecting advice, stubbornness,

source: །ཉེས་པ་ཆུང་ལ་ཆེར་ཁྲོ་དང་། རྙེད་པ་ལ་ནི་གདུ་བ་དང་། །བདག་ནི་རྙེད་པར་རབ་དགའ་ཞིང་། །གཞན་གྱི་རྙེད་ལ་མི་དགའ་བ།
en: Ingratitude, not repaying acts of kindness, “Becoming extremely angry at minor misfortunes, Being attached to gains, Exceedingly enjoying personal gain, And disliking the fortune of others.

source: །འདི་དག་ལ་ནི་ང་མི་བསྔགས།
en: “I have never praised narrow-mindedness,

source: །བློ་ཆུང་རྙེད་པ་བདག་འདོད་ཅིང་།
en: Desire for personal gain,

source: །གཞན་གྱི་རྙེད་ལ་ཕྲག་དོག་ཆེ།
en: Intense envy toward others’ gains,

source: །གཞན་གྱི་ཁྱིམ་ལ་སེར་སྣ་བྱེད། །
en: Or stinginess toward others’ households.

source: འདི་དག་ལ་ནི་ང་མི་བསྔགས། །རྙེད་པ་དག་ནི་ཚོལ་བའི་ཕྱིར། །སྤྱོད་ལམ་དག་ནི་འཆོས་བྱེད་པ། །འདི་ནི་འཚོ་བ་དག་མིན་པས།
en: “Since it is not right livelihood, Altering one’s deportment For the sake of acquiring worldly gain

source: །ང་ཡི་ཆོས་ལས་ཤིན་དུ་རིང་། །ལམ་གྱི་བསྒོམ་པ་དག་ལ་ནི།
en: Is very far removed from my Dharma.

source: །ཉེས་པ་འདི་དག་ཐམས་ཅད་ཡོད།
en: “All these faults are present In those who do not cultivate the path.

source: །འདི་ནི་ངན་འགྲོའི་རྐྱེན་ཡིན་པས།
en: Since they lead to rebirths in the lower realms,

source: །དངོས་པོ་འགའ་ཡང་བསྔགས་སུ་མེད། །
en: These faults are not to be praised at all.

source: སྡིག་པ་བདག་ལྟ་མ་སྤངས་ན། །འདོད་སྲེད་སེམས་ནི་རབ་ཏུ་མང་།
en: “Desire and craving will multiply in the minds Of those who do not abandon negative actions and the belief in a self.

source: །འདོད་སྲེད་སེམས་ནི་མང་བའི་ཕྱིར།
en: Because desire and craving will multiply in them,

source: །རྙེད་པ་དག་ལ་གདུ་བར་འགྱུར།
en: They will be attached to gains.

source: །བཟོད་བསྒོམས་སེམས་ཅན་ཕན་གདགས་ཤིང་།
en: ‘By cultivating patience, I will benefit sentient beings,

source: །ཁེངས་པའི་སེམས་ནི་རབ་བཏུལ་ནས།
en: Completely subdue my rigid mind,

source: །མྱུར་དུ་སངས་རྒྱས་བྱ་བར་གསུངས།
en: And swiftly awaken myself.

source: །བདག་གིས་བྱམས་སེམས་རབ་བསྒོམས་ཏེ།
en: “ ‘I will cultivate love

source: །བཟོད་པས་སེམས་ཅན་བརྩེ་བར་བྱ།
en: And patiently care for sentient beings.

source: །ཆོས་རྣམས་སྟོང་ཞིང་རྐྱེན་ལས་བྱུང་། །འབྲེལ་བ་མེད་པར་ཤེས་པར་བྱ།
en: I will understand that all phenomena are empty, Arise from conditions, and are disconnected.’

source: །རྐྱེན་གང་གིས་ནི་ཆོས་རྣམས་ཡོད།
en: “Through which conditions do phenomena exist?

source: །ཆོས་དེ་སེམས་ལས་བྱུང་བ་ཡིན།
en: Phenomena emerge from the mind.

source: །མི་བདེན་འདུ་ཤེས་ཁོང་ཁྲོ་བསྐྱེད།
en: False perceptions give rise to aggression.

source: །མཁས་པ་ཐམས་ཅད་སྟོང་པ་ཡིན།
en: For the wise, everything is empty!

source: །མི་བདེན་འདུ་ཤེས་ཁམས་གསུམ་བསྐྱེད།
en: “False perceptions give rise to the three realms,

source: །ལུས་ཀྱི་རྒྱུན་ནི་འཆད་མི་འགྱུར།
en: And the continuity of lifetimes will not be interrupted.

source: །མི་བདེན་འདུ་ཤེས་མི་རྟོག་ན། །ཉེས་དམིགས་འདི་དག་ཡོད་མི་འགྱུར།
en: These defects will not be present In those who do not entertain false perceptions.

source: །རྟག་ཏུ་ཆོས་རྣམས་སེམས་པ་ན།
en: “By always contemplating phenomena,

source: །རྐྱེན་ལས་བྱུང་བར་རབ་ཏུ་ཤེས།
en: Bodhisattvas clearly understand that they arise from conditions.

source: །རྟག་ཏུ་ཆོས་རྣམས་སྟོང་ལྟ་བས།
en: By always viewing phenomena as being empty,

source: །ཐམས་ཅད་ཡོངས་སུ་བཟློག་པར་ནུས།
en: They are able to counteract all those defects.

source: །ཁྲིམས་སྤངས་སེམས་ཅན་སྡུག་བསྔལ་བ། །ང་རྒྱལ་དག་གིས་སྨྲས་པ་ལ། །སྡུག་བསྔལ་ཉེར་ཞི་ཆོས་སྟོན་པས།
en: “By teaching the Dharma that pacifies suffering To suffering beings who have abandoned their discipline And are wounded by pride,

source: །ཕན་པ་མང་པོ་རབ་ཏུ་བྱེད།
en: They bring immense benefits.

source: །གང་ཞིག་ཤར་ནུབ་ལྷོ་བྱང་དང་། །ཕྱོགས་མཚམས་བཞི་པོ་དག་ནས་ནི།
en: “If someone coming from the east, west, south, or north, Or any of the intermediate directions,

source: །མི་གཙང་དུག་གི་བུམ་ཐོགས་ནས།
en: Carries a vase filled with feces or poison

source: །མགོ་ཡི་སྟེང་དུ་བླུགས་གྱུར་ན།
en: And pours its contents on their heads,

source: །སུས་བྱིན་སུས་ནི་ལེན་བྱེད་ཅེས། །བདག་ནི་ཁོང་ཁྲོ་ཡོང་མི་སྐྱེད། །ཆོས་གང་ཞིག་ནི་བདག་ཡིན་ཞེས། །བརྟགས་ནས་བརྩོན་འགྲུས་རྩོམ་པར་བྱེད།
en: “Bodhisattvas diligently investigate in this way: ‘Who is giving me this? Who is receiving it? I will not become aggressive, Because what is the self?

source: །ཉེས་པ་ཅི་ཡོད་གནོད་བྱས་ཤེས།
en: “ ‘Understanding the faults that cause harm,

source: །ངན་སེམས་གཞན་ལ་ལྟ་མི་བྱེད།
en: Without looking at others with a harmful intent,

source: །ཤིན་དུ་བརྟན་པའི་བཟོད་བསྐྱེད་ནས།
en: And giving rise to a firm resolve,

source: །བྱམས་སེམས་གཞན་ལ་ཕན་འདོགས་བྱེད།
en: I will benefit others with a kind attitude.

source: །སྔོན་གྱི་ལས་ལས་གྱུར་ཤེས་པས། །རྣམ་སྨིན་འདི་མྱོང་སྙམ་དུ་སེམས།
en: “ ‘I understand that the karmic ripening I experience Is the result of my own previous actions.

source: །དང་དུ་བླངས་ཏེ་བཟོད་བྱེད་པས།
en: I will acknowledge this, no longer do such things again,

source: །བྱང་ཆུབ་ལམ་ལ་གནས་པར་བྱེད།
en: And remain on the path of awakening.

source: །དམོད་དང་སྡུག་བསྔལ་དངོས་པོ་འདི།
en: “ ‘I know that any abuse and suffering I experience

source: །གཞན་གྱིས་བྱས་པ་མ་ཡིན་གྱི།
en: Has not been created by others;

source: །འདི་ནི་ངེས་པར་ལས་ཀྱི་རྐྱེན།
en: It is surely the result of my own actions.

source: །ཡུན་རིང་ལོན་ཀྱང་ཆུད་མི་ཟ།
en: Though time may pass, those consequences are never lost.

source: །སེམས་ཅན་འཇིག་རྟེན་གནས་པ་དག །རྟག་ཏུ་དགེ་སྡིག་ལས་སློང་བས།
en: “ ‘Sentient beings living in the world Always engage in virtuous and negative actions.

source: །དེང་བདག་སྡུག་བསྔལ་འདི་མྱོང་ཡང་།
en: Even if I now experience suffering,

source: །ལས་རྐྱེན་ཡིན་པར་རབ་ཏུ་ཤེས།
en: I clearly understand that it is the consequence of my own actions.

source: །གལ་ཏེ་ངན་པའི་ལས་བྱས་ན། །ཕྱིས་ཀྱང་སྡུག་བསྔལ་མྱོང་འགྱུར་ན། །ཅིའི་ཕྱིར་དངོས་པོ་ངན་པ་ཡིས། །དེ་དག་ལ་ནི་གནོད་བྱ་སྙམ།
en: “ ‘If, as retribution for negative actions, I will experience suffering in the future, Why should I harm others By committing such actions?

source: །བླ་ན་མེད་པའི་ཆོས་གཉེར་ནས། །གཞན་དག་ལ་ནི་སྟོན་བྱེད་པས། །སེམས་ཅན་སྡུག་བསྔལ་ཇི་སྙེད་པ། །ཐམས་ཅད་ལས་ནི་ཐར་བར་བྱེད།
en: “ ‘By pursuing the unsurpassed Dharma And teaching it to others, I will liberate sentient beings From all their sufferings.

source: །གལ་ཏེ་འགའ་ཞིག་མེ་ཏོག་སྤོས། །ཕྲེང་བ་དག་གིས་བདག་མཆོད་ཀྱང་།
en: “ ‘Even if someone worships me by offering me Flowers, perfumes, and garlands,

source: །རྗེས་སུ་ཆགས་པ་མི་སྐྱེད་པར།
en: I will not become attached to that person,

source: །མཉམ་པར་བསྒོམ་པ་བསྒྲུབ་བྱ་སྙམ།
en: But will cultivate an attitude of equanimity.’

source: །བྱམས་སྡང་དག་ནི་ལམ་མིན་པས། །རྟག་ཏུ་བཏང་སྙོམས་སྤྱོད་པར་བྱེད། །སུས་བྱིན་སུས་ནི་ལེན་བྱེད་ཅེས། །ཆོས་རྣམས་ཡང་དག་རྟོག་པར་བྱེད།
en: “ ‘Since attachment and aversion are not the way, I will always practice equanimity And investigate phenomena properly with the thought, “Who is giving this? Who is receiving it?
